[
    {
        "indent": 0,
        "user": "quantumCoder93",
        "text": "Wow, I can't believe someone could be trapped in Vim for 5 years. I mean, I know it's a running joke, but this is next level.",
        "posted": "2023-04-08 13:34:38.736024"
    },
    {
        "indent": 1,
        "user": "justAnotherDev",
        "text": "Haha, yeah. It's like the Hotel California of text editors – you can check out any time you like, but you can never leave.",
        "posted": "2023-04-08 13:26:38.736024"
    },
    {
        "indent": 2,
        "user": "pythOn_n00bie",
        "text": "I've heard of some people getting stuck for a few hours or even days, but 5 years is just insane. The dedication is impressive, though.",
        "posted": "2023-04-08 14:11:38.736024"
    },
    {
        "indent": 0,
        "user": "hackSquasher",
        "text": "I bet they've become a Vim master now. They could probably navigate and manipulate text faster than the speed of light.",
        "posted": "2023-04-08 13:21:38.736024"
    },
    {
        "indent": 1,
        "user": "devOpsGuru42",
        "text": "Absolutely! If anything, they'll have a tough time readjusting to using other text editors now. Imagine trying to use nano after 5 years in Vim.",
        "posted": "2023-04-08 13:32:38.736024"
    },
    {
        "indent": 2,
        "user": "_bitCrafter",
        "text": "Speaking of nano, I remember a friend of mine who used to call it \"Vim for Dummies.\" Now that I think about it, maybe it's not such a bad thing to be trapped in Vim after all.",
        "posted": "2023-04-08 13:56:38.736024"
    },
    {
        "indent": 0,
        "user": "leetCodeWarrior",
        "text": "I wonder if there's a support group for people who've escaped Vim. You know, like Vim Anonymous or something.",
        "posted": "2023-04-08 13:47:38.736024"
    },
    {
        "indent": 1,
        "user": "regexNinja",
        "text": "If there isn't one, we should definitely start it. It could be like a 12-step program to help people reintegrate into the world of non-modal text editors.",
        "posted": "2023-04-08 13:35:38.736024"
    },
    {
        "indent": 2,
        "user": "scriptKiddie95",
        "text": "Step 1: Admitting you have a problem. \"Hi, I'm [insert name] and I've been stuck in Vim for [insert number] years.\"",
        "posted": "2023-04-08 13:57:38.736024"
    }
]