[
    {
        "indent": 0,
        "user": "quantumLeap42",
        "text": "This has to be one of the most bizarre startups I've seen recently. I can't imagine how the pitch meeting went for this self-driving unicycle.",
        "posted": "2023-04-08 20:36:07.310566"
    },
    {
        "indent": 1,
        "user": "snake_case_enthusiast",
        "text": "I heard it went something like: \"We are revolutionizing personal transportation by combining the elegance of the unicycle with the convenience of self-driving technology!\" 😂",
        "posted": "2023-04-08 21:18:07.310566"
    },
    {
        "indent": 2,
        "user": "dev_in_disguise",
        "text": "And then they added, \"Why settle for two wheels when you can have one?\" 🤣",
        "posted": "2023-04-08 21:30:07.310566"
    },
    {
        "indent": 0,
        "user": "bit_shift_master",
        "text": "Finally, a mode of transportation for those who want the self-driving experience but can't afford a Tesla!",
        "posted": "2023-04-08 21:30:07.310566"
    },
    {
        "indent": 1,
        "user": "CamelCaseCoder",
        "text": "Can't wait for the inevitable self-driving unicycle vs Tesla showdown on YouTube.",
        "posted": "2023-04-08 21:30:07.310566"
    },
    {
        "indent": 2,
        "user": "NoCapsForMe",
        "text": "I'm placing my bets on the unicycle. It's got that underdog charm.",
        "posted": "2023-04-08 21:30:07.310566"
    },
    {
        "indent": 0,
        "user": "Un1c0rn_F0und3r",
        "text": "Are they using the same LIDAR and computer vision technology as other self-driving vehicles, or have they come up with a completely new approach to deal with the... unique challenges a self-driving unicycle would face?",
        "posted": "2023-04-08 21:30:07.310566"
    },
    {
        "indent": 1,
        "user": "ByteBandit27",
        "text": "They're probably using some top-secret, proprietary technology that involves a combination of LIDAR, computer vision, and a highly skilled circus performer. 🎪",
        "posted": "2023-04-08 21:30:07.310566"
    },
    {
        "indent": 0,
        "user": "AI_D0minance",
        "text": "I can't help but think of the potential chaos these self-driving unicycles could cause on the streets. I'm just picturing them swerving around pedestrians and other vehicles with no warning.",
        "posted": "2023-04-08 21:30:07.310566"
    },
    {
        "indent": 1,
        "user": "masterOfPuns",
        "text": "Don't worry, they've got it covered. I heard they're working on a pedestrian detection system called \"UniWatch,\" which also doubles as a unicycle-based neighborhood watch program. 😜",
        "posted": "2023-04-08 21:30:07.310566"
    },
    {
        "indent": 0,
        "user": "xXData_WizardXx",
        "text": "I wonder if there's a market for self-driving unicycles, or if it's just a gimmick. The concept is definitely unique, but is it practical?",
        "posted": "2023-04-08 21:30:07.310566"
    },
    {
        "indent": 1,
        "user": "qwertyJester",
        "text": "I think it might just be the next big thing in transportation. I mean, who wouldn't want to ride around on a self-driving unicycle while sipping their morning coffee and browsing Hackernews? 🦄",
        "posted": "2023-04-08 21:30:07.310566"
    }
]