[
    {
        "indent": 0,
        "user": "SiliconValleyGuru",
        "text": "Recursive startups? This sounds like a fun new way to get lost in bureaucracy. Can't wait to see how deep the rabbit hole goes!",
        "posted": "2023-04-10 02:41:50.478582"
    },
    {
        "indent": 1,
        "user": "startupMania",
        "text": "It's like Inception for startups. I'm waiting for someone to create a startup that's focused on explaining these recursive startups.",
        "posted": "2023-04-10 04:07:50.478582"
    },
    {
        "indent": 2,
        "user": "QuantumCoder",
        "text": "Maybe we should create a startup that creates explanations for the startups created by these recursive startups. It's recursion all the way down!",
        "posted": "2023-04-10 04:21:50.478582"
    },
    {
        "indent": 0,
        "user": "techJunkie83",
        "text": "I can already see the pitch for investors: \"Our startups create startups that create startups, which means infinite exponential growth!\"",
        "posted": "2023-04-10 05:28:50.478582"
    },
    {
        "indent": 1,
        "user": "code_monkey42",
        "text": "Except, as we all know, infinite growth is not sustainable. At some point, we'll have startups creating startups that create...pizzas?",
        "posted": "2023-04-10 05:47:50.478582"
    },
    {
        "indent": 2,
        "user": "fractal_guy",
        "text": "Nah, it's turtles all the way down, not pizzas.",
        "posted": "2023-04-10 06:39:50.478582"
    },
    {
        "indent": 0,
        "user": "DataCruncherXL",
        "text": "What would happen if one of these recursive startups creates a startup that also creates recursive startups?",
        "posted": "2023-04-10 06:52:50.478582"
    },
    {
        "indent": 1,
        "user": "StrangeLoop_",
        "text": "You just blew my mind. It's like a fractal of startups!",
        "posted": "2023-04-10 07:13:50.478582"
    },
    {
        "indent": 2,
        "user": "InfiniteLoopMaster",
        "text": "I think we've found the solution for perpetual funding. Just create recursive startups creating recursive startups creating...you get the idea.",
        "posted": "2023-04-10 07:25:50.478582"
    },
    {
        "indent": 0,
        "user": "YoYo_Dyne",
        "text": "Has anyone considered the tax implications of this? Each new startup would need its own accounting department, and don't get me started on international regulations...",
        "posted": "2023-04-10 07:39:50.478582"
    },
    {
        "indent": 1,
        "user": "xX_TaxNinja_Xx",
        "text": "Recursive startups meet recursive tax forms. The IRS will have a field day.",
        "posted": "2023-04-10 08:06:50.478582"
    },
    {
        "indent": 2,
        "user": "CPAasaurus",
        "text": "It's like a never-ending nesting doll of audits.",
        "posted": "2023-04-10 11:10:50.478582"
    },
    {
        "indent": 0,
        "user": "SoylentCoder",
        "text": "Recursive startups are people! Or at least, they will be once we run out of ideas for new startups.",
        "posted": "2023-04-10 11:44:50.478582"
    },
    {
        "indent": 1,
        "user": "techOracle",
        "text": "I've seen the future, and it's a world where all startups are just startups creating other startups, and nobody does any actual work. It's like the singularity, but for venture capital.",
        "posted": "2023-04-10 15:02:50.478582"
    },
    {
        "indent": 2,
        "user": "AgileAvocado",
        "text": "So...basically like now?",
        "posted": "2023-04-10 16:16:50.478582"
    }
]