[
    {
        "indent": 0,
        "user": "tech_tinkerer",
        "text": "So, this is the new \"disruptive\" business model, huh? Doing nothing and getting rich. Genius!",
        "posted": "2023-04-10 00:39:25.108712"
    },
    {
        "indent": 1,
        "user": "codeRage",
        "text": "I wish I had thought of that when I started my own startup. Would have saved me a ton of time and effort!",
        "posted": "2023-04-10 01:36:25.108712"
    },
    {
        "indent": 2,
        "user": "neural_net_ninja",
        "text": "Yeah, but how do they actually make money? Is it just by generating hype and securing investments?",
        "posted": "2023-04-10 02:35:25.108712"
    },
    {
        "indent": 3,
        "user": "bitwiseBuddy",
        "text": "My guess is that they're selling their \"doing nothing\" methodology to other companies. The less you do, the less you can screw up, am I right?",
        "posted": "2023-04-10 02:49:25.108712"
    },
    {
        "indent": 0,
        "user": "devs_dream",
        "text": "I heard they were going to IPO soon. I'm going to put my life savings into it. YOLO!",
        "posted": "2023-04-10 03:35:25.108712"
    },
    {
        "indent": 1,
        "user": "silicon_valley_vet",
        "text": "Are you serious? That sounds like a terrible idea...",
        "posted": "2023-04-10 04:13:25.108712"
    },
    {
        "indent": 2,
        "user": "devs_dream",
        "text": "Of course I'm not serious! I was being sarcastic. Although with the way the market works these days, who knows, maybe it would be a good investment!",
        "posted": "2023-04-10 07:32:25.108712"
    },
    {
        "indent": 0,
        "user": "StartupSoothsayer",
        "text": "They're obviously onto something. This is the natural progression of minimalist companies. First, it was \"do one thing and do it well.\" Now, it's \"do nothing and do it perfectly.\"",
        "posted": "2023-04-10 09:33:25.108712"
    },
    {
        "indent": 1,
        "user": "dontPanic42",
        "text": "And the next step will be \"do less than nothing and excel at it.\" Can't wait to see what that looks like!",
        "posted": "2023-04-10 10:37:25.108712"
    },
    {
        "indent": 2,
        "user": "esoteric_elon",
        "text": "Maybe we'll finally discover the secret to creating perpetual motion machines by doing less than nothing!",
        "posted": "2023-04-10 13:07:25.108712"
    },
    {
        "indent": 0,
        "user": "codeMaverick",
        "text": "I bet their burn rate is exceptionally low. Investors must love that!",
        "posted": "2023-04-10 13:30:25.108712"
    },
    {
        "indent": 1,
        "user": "supercoder9000",
        "text": "But what's the return on investment? Even if the burn rate is low, if there's no product or service, there can't be any revenue.",
        "posted": "2023-04-10 14:45:25.108712"
    },
    {
        "indent": 2,
        "user": "codeMaverick",
        "text": "They're probably just selling \"nothing\" as a service. NaaS: the future of tech!",
        "posted": "2023-04-10 15:44:25.108712"
    },
    {
        "indent": 3,
        "user": "devDynamo",
        "text": "NaaS? That's hilarious! But you might be onto something. I can see a market for it. Imagine selling nothing to the government. They'd pay millions for that.",
        "posted": "2023-04-10 15:48:25.108712"
    }
]