[
    {
        "indent": 0,
        "user": "coder_mania",
        "text": "Finally, a sport I can excel in without leaving my couch! 🛋️",
        "posted": "2023-04-10 06:44:28.730964"
    },
    {
        "indent": 1,
        "user": "devMastermind",
        "text": "That's the spirit! This might just be the start of a new generation of Olympic \"athletes\".",
        "posted": "2023-04-10 07:02:28.730964"
    },
    {
        "indent": 2,
        "user": "pythonFan_42",
        "text": "Imagine the rigorous training sessions and all the high-tech equipment needed to compete at the highest level! 😂",
        "posted": "2023-04-10 07:37:28.730964"
    },
    {
        "indent": 0,
        "user": "bitFlipper",
        "text": "I can see the headlines now: \"Nation's productivity plummets as citizens train for doomscrolling gold\"",
        "posted": "2023-04-10 09:39:28.730964"
    },
    {
        "indent": 1,
        "user": "Capt_Caffeine",
        "text": "We could turn this into a national pastime! Who needs baseball when you have doomscrolling?",
        "posted": "2023-04-10 09:41:28.730964"
    },
    {
        "indent": 2,
        "user": "allCapsCoder",
        "text": "I'M ALREADY TRAINING FOR THE 2028 OLYMPICS, GOTTA GET AHEAD OF THE COMPETITION",
        "posted": "2023-04-10 11:24:28.730964"
    },
    {
        "indent": 3,
        "user": "neuralNerd",
        "text": "I bet AI coaches will be a thing for this sport. Optimization algorithms to help you doomscroll more efficiently!",
        "posted": "2023-04-10 11:30:28.730964"
    },
    {
        "indent": 0,
        "user": "TechSkeptic89",
        "text": "I wonder what kind of performance-enhancing substances they'll be testing for... Twitter-oids? 🤔",
        "posted": "2023-04-10 13:08:28.730964"
    },
    {
        "indent": 1,
        "user": "asyncAvatar",
        "text": "Maybe they'll have special categories for various platforms: Twitter, Reddit, Facebook... The social media triathlon!",
        "posted": "2023-04-10 13:29:28.730964"
    },
    {
        "indent": 2,
        "user": "ZeroBugBounty",
        "text": "And don't forget the events for different devices: smartphone, tablet, laptop. The possibilities are endless!",
        "posted": "2023-04-10 13:34:28.730964"
    },
    {
        "indent": 0,
        "user": "dataWrangler_",
        "text": "What will be the criteria for winning? Most hours doomscrolled? Most negative news consumed? ",
        "posted": "2023-04-10 13:50:28.730964"
    },
    {
        "indent": 1,
        "user": "NotYourAvgCoder",
        "text": "I think it should be a mix of speed and accuracy – points for finding and engaging with the most depressing content in the shortest amount of time.",
        "posted": "2023-04-10 15:02:28.730964"
    },
    {
        "indent": 2,
        "user": "unicorn_hunter",
        "text": "So basically, it's like an endurance test for your mental health. Let's see who can be the most miserable!",
        "posted": "2023-04-10 15:56:28.730964"
    },
    {
        "indent": 3,
        "user": "goLangGuru",
        "text": "That's one way to embrace our dystopian reality, I suppose. 😅",
        "posted": "2023-04-10 16:34:28.730964"
    }
]