[
    {
        "indent": 0,
        "user": "bitNinja42",
        "text": "I never thought I'd see the day when the whole world would be Rickrolled in unison.",
        "posted": "2023-04-10 15:58:40.757482"
    },
    {
        "indent": 1,
        "user": "CodeMaster01",
        "text": "We truly live in a strange era. On the bright side, it's been a while since I got Rickrolled, so it was kind of nostalgic.",
        "posted": "2023-04-10 16:03:40.757482"
    },
    {
        "indent": 2,
        "user": "randomThinker",
        "text": "Imagine being the one who pulled this off. Instant Internet legend status.",
        "posted": "2023-04-10 16:11:40.757482"
    },
    {
        "indent": 0,
        "user": "devHacker777",
        "text": "I wonder how many people were in the middle of something critical when they got Rickrolled.",
        "posted": "2023-04-10 16:11:40.757482"
    },
    {
        "indent": 1,
        "user": "systemCrasher",
        "text": "I was working on a deadline, and I couldn't help but laugh when it happened. Talk about a \"break\" from work.",
        "posted": "2023-04-10 16:11:40.757482"
    },
    {
        "indent": 2,
        "user": "TeslaDude",
        "text": "I was watching a SpaceX live stream. Rick Astley in space, now that's something new.",
        "posted": "2023-04-10 16:12:40.757482"
    },
    {
        "indent": 0,
        "user": "leetCoder69",
        "text": "I've got to admit, this is one of the most impressive hacks in recent history.",
        "posted": "2023-04-10 16:12:40.757482"
    },
    {
        "indent": 1,
        "user": "binaryPirate",
        "text": "As much as I hate to admit it, I'm kind of impressed. The sheer scale of the hack is something to marvel at.",
        "posted": "2023-04-10 16:13:40.757482"
    },
    {
        "indent": 2,
        "user": "netizenPrime",
        "text": "Agreed, but it does raise some serious security concerns. If someone could do this with a harmless video, imagine what else they could do.",
        "posted": "2023-04-10 16:13:40.757482"
    },
    {
        "indent": 0,
        "user": "DataWhizKid",
        "text": "I'm just waiting for the post-mortem analysis on how this happened. It's going to be an interesting read for sure.",
        "posted": "2023-04-10 16:15:40.757482"
    },
    {
        "indent": 1,
        "user": "CyberSleuth",
        "text": "Yeah, I'm curious about the technical details behind this. Was it a DNS hijack, a massive BGP leak, or something else entirely?",
        "posted": "2023-04-10 16:27:40.757482"
    },
    {
        "indent": 2,
        "user": "KernelKev",
        "text": "I've got my popcorn ready. The security community is going to have a field day dissecting this one.",
        "posted": "2023-04-10 16:30:40.757482"
    },
    {
        "indent": 0,
        "user": "TimeTraveler3",
        "text": "I came from 2040, just to say that this event will be remembered as a turning point in internet security.",
        "posted": "2023-04-10 16:31:40.757482"
    },
    {
        "indent": 1,
        "user": "QuantumCat",
        "text": "Oh, and what exactly changes because of this event? Or is that classified information?",
        "posted": "2023-04-10 16:31:40.757482"
    },
    {
        "indent": 2,
        "user": "TimeTraveler3",
        "text": "Let's just say that there's a bright future ahead for those working in cybersecurity. And Rick Astley's career gets a massive resurgence.",
        "posted": "2023-04-10 16:35:40.757482"
    }
]