[
    {
        "indent": 0,
        "user": "CryptoHacker42",
        "text": "Can't believe something as simple as forgetting a browser tab could make someone a millionaire. This guy must be incredibly lucky!",
        "posted": "2023-04-10 11:46:35.923332"
    },
    {
        "indent": 1,
        "user": "CodeGuru101",
        "text": "I mean, I forget to close browser tabs all the time. Where's my million dollars? I guess I've been doing it wrong all these years.",
        "posted": "2023-04-10 12:07:35.923332"
    },
    {
        "indent": 2,
        "user": "DataNerd88",
        "text": "Clearly, you need to level up your tab-forgetting game. Try opening more obscure, high-risk tabs and then forgetting about them for maximum returns.",
        "posted": "2023-04-10 12:59:35.923332"
    },
    {
        "indent": 0,
        "user": "SiliconSkeptic",
        "text": "I'm always amazed at the kind of \"accidents\" that seem to make people millionaires. Maybe I should just stop trying so hard and let serendipity take over.",
        "posted": "2023-04-10 13:39:35.923332"
    },
    {
        "indent": 1,
        "user": "DevOpsDude23",
        "text": "Yeah, because nothing says \"financial success\" like throwing caution to the wind and letting fate decide your future. Good plan!",
        "posted": "2023-04-10 13:51:35.923332"
    },
    {
        "indent": 2,
        "user": "QuantumLeap2021",
        "text": "I mean, isn't that how most startup founders operate anyway? Throw spaghetti at the wall and see what sticks? Fortune favors the bold, or the forgetful in this case.",
        "posted": "2023-04-10 14:00:35.923332"
    },
    {
        "indent": 3,
        "user": "RustFanatic",
        "text": "Can confirm. Once forgot a sandwich in my backpack for a week and it became a lucrative artisanal mold farm. Serendipity is the new business strategy.",
        "posted": "2023-04-10 14:32:35.923332"
    },
    {
        "indent": 0,
        "user": "TabHoardingMaster",
        "text": "This is it. This is the validation I needed for my 100+ open tabs lifestyle. I knew it would pay off one day!",
        "posted": "2023-04-10 15:31:35.923332"
    },
    {
        "indent": 1,
        "user": "WebSurfer69",
        "text": "As a fellow tab hoarder, I fully support this statement. We're not messy, we're just playing the long game.",
        "posted": "2023-04-10 15:45:35.923332"
    },
    {
        "indent": 2,
        "user": "ZenCoder3000",
        "text": "I once had 300+ tabs open on my browser, it felt like I was surfing the web on the edge of a black hole. There must be at least a couple of million dollars hidden in there somewhere.",
        "posted": "2023-04-10 15:59:35.923332"
    },
    {
        "indent": 3,
        "user": "PiDayEnthusiast",
        "text": "Good luck trying to find that needle in a haystack of tabs. Better start searching now, maybe by the time you retire you'll have found your fortune.",
        "posted": "2023-04-10 16:36:35.923332"
    }
]