[
    {
        "indent": 0,
        "user": "dev_enigma",
        "text": "Interesting read! It's amazing how far science has come in finding a correlation between veganism and telekinesis. Just imagine the possibilities!",
        "posted": "2023-04-08 03:02:59.860530"
    },
    {
        "indent": 1,
        "user": "codeRaptor",
        "text": "I have my doubts, but the concept of unlocking hidden potential within ourselves through diet is pretty intriguing.",
        "posted": "2023-04-08 02:51:59.860530"
    },
    {
        "indent": 2,
        "user": "binaryDruid",
        "text": "I'm not sure if I'm ready to believe this just yet, but hey, if it motivates more people to go vegan, that's a net positive for the planet.",
        "posted": "2023-04-08 02:29:59.860530"
    },
    {
        "indent": 0,
        "user": "hacker_dude42",
        "text": "Honestly, it sounds like something out of a comic book. I'll need to see some solid evidence before I buy into this.",
        "posted": "2023-04-08 02:38:59.860530"
    },
    {
        "indent": 1,
        "user": "QUANTUMtech",
        "text": "Yeah, I'm with you. It's a fun idea, but it seems pretty far-fetched. I'd love to see some rigorous scientific studies on this.",
        "posted": "2023-04-08 03:16:59.860530"
    },
    {
        "indent": 0,
        "user": "BitByteBooster",
        "text": "If this is true, I'm going to start practicing telekinesis at every meal. I'll never have to get up for seconds again!",
        "posted": "2023-04-08 03:24:59.860530"
    },
    {
        "indent": 1,
        "user": "GreenCodeRider",
        "text": "Haha, that's a great idea! But seriously, if telekinesis was real, it would make a lot of daily tasks so much easier.",
        "posted": "2023-04-08 02:55:59.860530"
    },
    {
        "indent": 2,
        "user": "RadicalPiGuy",
        "text": "And imagine how it would revolutionize transportation and industry! Telekinetic-powered vehicles, anyone?",
        "posted": "2023-04-08 03:24:59.860530"
    },
    {
        "indent": 0,
        "user": "NeuralZap",
        "text": "This article reminds me of that Onion article about how meditation helps achieve levitation. Although, if there's even a sliver of truth to this, I might consider going vegan.",
        "posted": "2023-04-08 02:28:59.860530"
    },
    {
        "indent": 1,
        "user": "AIgonWild",
        "text": "That's an interesting parallel. It's always good to maintain a healthy skepticism, but exploring these ideas can lead to some fascinating discoveries.",
        "posted": "2023-04-08 03:10:59.860530"
    },
    {
        "indent": 2,
        "user": "The_WebSlinger",
        "text": "Exactly, remember when people thought the idea of a reusable rocket was laughable? Now look at SpaceX. Never underestimate the power of human innovation.",
        "posted": "2023-04-08 02:54:59.860530"
    },
    {
        "indent": 0,
        "user": "NoScopeNinja",
        "text": "Are we sure this isn't an April Fool's joke that got published late? Because if not, I might have just found my motivation to finally go vegan.",
        "posted": "2023-04-08 02:43:59.860530"
    },
    {
        "indent": 1,
        "user": "CaffeineCoder",
        "text": "You and me both! If going vegan means I can move objects with my mind, sign me up. It's a win-win for the environment and my newfound superpowers.",
        "posted": "2023-04-08 03:06:59.860530"
    }
]