[
    {
        "indent": 0,
        "user": "coder_enthusiast",
        "text": "This is absolutely wild! Can you imagine the level of competition between these tech CEOs? The stakes have never been higher!",
        "posted": "2023-04-10 13:20:29.807493"
    },
    {
        "indent": 1,
        "user": "hackerman42",
        "text": "I know, right? It's like a modern-day gladiator battle, but with keyboards and caffeine instead of swords and shields.",
        "posted": "2023-04-10 13:26:29.807493"
    },
    {
        "indent": 2,
        "user": "neuralwizard",
        "text": "I wonder if any of them will try to secretly sabotage their rivals' code. Talk about corporate espionage!",
        "posted": "2023-04-10 14:10:29.807493"
    },
    {
        "indent": 0,
        "user": "dev_zealot",
        "text": "I'm not sure how I feel about this. On one hand, it's entertaining, but on the other hand, it's concerning that employees are treated like commodities.",
        "posted": "2023-04-10 14:21:29.807493"
    },
    {
        "indent": 1,
        "user": "code_monkey",
        "text": "Totally agree. While the concept is amusing, it doesn't sit right with me that people's livelihoods are at stake in this \"winner takes all\" scenario.",
        "posted": "2023-04-10 14:31:29.807493"
    },
    {
        "indent": 2,
        "user": "bitwise_logic",
        "text": "It's a double-edged sword, for sure. But maybe it'll lead to better working conditions if CEOs are forced to think about their employees' satisfaction more directly.",
        "posted": "2023-04-10 15:06:29.807493"
    },
    {
        "indent": 3,
        "user": "karmic_coder",
        "text": "I hope you're right. But in the meantime, I'm just here for the memes that will inevitably come out of this event.",
        "posted": "2023-04-10 15:12:29.807493"
    },
    {
        "indent": 0,
        "user": "nerd_pride",
        "text": "Does anyone know what the coding challenges will be like? I'd love to see these CEOs tackle some truly difficult problems.",
        "posted": "2023-04-10 15:27:29.807493"
    },
    {
        "indent": 1,
        "user": "algorithm_addict",
        "text": "I heard a rumor that they'll be thrown into real-world, high-pressure scenarios. Like fixing production bugs while millions of users are watching.",
        "posted": "2023-04-10 15:41:29.807493"
    },
    {
        "indent": 2,
        "user": "coffee_and_code",
        "text": "If that's true, I can't wait to see which CEO will crack under the pressure. This is going to be better than any reality TV show!",
        "posted": "2023-04-10 15:57:29.807493"
    },
    {
        "indent": 3,
        "user": "parallel_processing",
        "text": "I'm low-key rooting for a dark horse CEO to come out of nowhere and sweep the competition. That would be the ultimate twist!",
        "posted": "2023-04-10 16:04:29.807493"
    }
]