[{"indent": 0, "user": "coder_protein", "text": "I never thought I'd see the day when protein shakes and coding would be combined. I'm all for optimizing physical health, but how does this even correlate with better software engineering?", "posted": "2023-04-08 02:23:58.013856"}, {"indent": 1, "user": "devBrosFTW", "text": "It's all about the mental gains, coder_protein! If you're fit and healthy, you've got more energy to focus on coding. Plus, nothing beats the feeling of crushing a heavy deadlift and then pushing through a tough refactor. 💪🤓", "posted": "2023-04-08 03:00:58.013856"}, {"indent": 2, "user": "devSwoleNerd", "text": "Totally agree with you, devBrosFTW! I've been doing this for the past year and my productivity skyrocketed. If you look at it from a holistic perspective, taking care of your body can have a positive impact on your mind, which in turn improves your work.", "posted": "2023-04-08 02:05:58.013856"}, {"indent": 0, "user": "codePunisher", "text": "I'm waiting for the day when someone releases a \"Gym-Driven Development\" framework. 😂", "posted": "2023-04-08 02:12:58.013856"}, {"indent": 1, "user": "agileGymRat", "text": "Don't give them any ideas, codePunisher! Next thing you know, we'll have daily stand-ups on treadmills and pair programming while bench pressing.", "posted": "2023-04-08 02:51:58.013856"}, {"indent": 2, "user": "jackedDev", "text": "I'm pretty sure I've seen a startup doing something similar. It was a coworking space with a gym, and they had \"fitness breaks\" in between coding sessions. It's a brave new world!", "posted": "2023-04-08 02:31:58.013856"}, {"indent": 0, "user": "d3v_nUtriti0n", "text": "I can already see the new job postings: \"Full Stack Developer - Must have 3+ years of experience in JavaScript, Python, and weightlifting. Bonus points for CrossFit experience.\"", "posted": "2023-04-08 02:42:58.013856"}, {"indent": 1, "user": "gymOverflow", "text": "You joke, but I saw a job posting last week that required \"a passion for fitness and technology.\" I'm pretty sure the devbro revolution is upon us.", "posted": "2023-04-08 02:13:58.013856"}, {"indent": 2, "user": "heavyLifterCoder", "text": "As long as they don't start measuring our KLOCs (Kilograms Lifted Over Code), I'm good with it. Work-life balance is important, but let's not get too carried away!", "posted": "2023-04-08 02:51:58.013856"}]